In [26]:
import pymongo 
import pandas as pd
import numpy as np
import config

In [27]:
# Connect with the portnumber and host  
client = pymongo.MongoClient(config.mongo_conn)  
    
# Access database  
cl_db = client['craigslist_db']  
    
# Access collection of the database  
cl_collection = cl_db['listings']

In [37]:
# Number of each type
agg_result = cl_collection.aggregate( 
    [{ 
    "$group" :  
        {"_id" : "$listing_type",  
         "Count" : {"$sum" : 1} 
         }} 
    ]) 

cl_df = pd.DataFrame(list(agg_result))
cl_df.columns = ['type', 'count']
cl_df

        type  count
0      House    530
1      Place      2
2  Apartment   7404
3       None     43

In [43]:
# Number of each type
agg_result = cl_collection.aggregate( 
    [{ 
    "$group" :  
        {"_id" : "$listing_price",  
         "Count" : {"$avg" : 1} 
         }} 
    ]) 

cl_df = pd.DataFrame(list(agg_result))
cl_df.columns = ['price', 'average']
cl_df

       price  average
0     $2,195      1.0
1     $2,354      1.0
2     $1,437      1.0
3     $2,125      1.0
4     $2,518      1.0
...      ...      ...
1072  $5,290      1.0
1073  $2,380      1.0
1074  $1,325      1.0
1075  $2,245      1.0
1076  $2,064      1.0

[1077 rows x 2 columns]

In [40]:
# Number of each type
agg_result = cl_collection.aggregate( 
    [{ 
    "$group" :  
        {"_id" : "$listing_bedbath",  
         "Types" : {"$sum" : 1} 
         }} 
    ]) 
cl_df = pd.DataFrame(list(agg_result))
cl_df.columns = ['bed bath', 'count']
cl_df

          bed bath  count
0        7BR / 5Ba      1
1      1BR / 1.5Ba     31
2      2BR / 1.5Ba    117
3             None     43
4      4BR / 3.5Ba      3
5      5BR / 3.5Ba      1
6        6BR / 4Ba      2
7   0BR / sharedBa      7
8        5BR / 4Ba      1
9        1BR / 2Ba      4
10       2BR / 3Ba      3
11       2BR / 1Ba    965
12     0BR / 1.5Ba      2
13       3BR / 3Ba     55
14   0BR / splitBa      1
15       2BR / 2Ba   1951
16       5BR / 3Ba      7
17       6BR / 7Ba      2
18       6BR / 2Ba      1
19     6BR / 6.5Ba      1
20       6BR / 5Ba      1
21       3BR / 1Ba     16
22       0BR / 2Ba      3
23       4BR / 2Ba     46
24       6BR / 3Ba      3
25       7BR / 6Ba      1
26       4BR / 3Ba     18
27       3BR / 4Ba      1
28       4BR / 4Ba      3
29     7BR / 3.5Ba      1
30       3BR / 2Ba    415
31       1BR / 1Ba   3437
32      8BR / 9+Ba      2
33     3BR / 2.5Ba     85
34     4BR / 2.5Ba     18
35     4BR / 4.5Ba      1
36     3BR / 3.5Ba     18
37     2BR / 2.5Ba     91
38  1BR / sharedBa      6
39       7BR / 4Ba      1
40       0BR / 1Ba    589
41     3BR / 1.5Ba     25